{
    "start": "YOUR_ROOM",
    "rooms": [
        {
			"label": "YOUR_ROOM",
			"name":  "your bedroom",
			"description": "You are standing in your bedroom. Perhaps you are a young person who only now, on your 13th birthday, will receive a name. You have a pretty window in the corner overlooking the world outside. There's a door leading to your bathroom to the east, and a door leading to the hall to the south.",
			"exits": [
				{
					"destLabel":     "BATHROOM",
					"description":   "your bathroom door",
					"aliases":       ["BATHROOM", "TOILET", "DOOR", "EAST"],
					"travelMessage": "You go through the door and enter the bathroom."
				},
				{
					"destLabel":     "HALLWAY",
					"description":   "the door to the hall",
					"aliases":       ["HALLWAY", "HALL", "OUT", "SOUTH"],
					"travelMessage": "You shut the door behind you as you go into the hall."
				}
            ],
            "items": [
                {
                    "label": "POGO_HAMMER",
                    "name": "a pogo hammer",
                    "description": "Your treasured hammer mixed with a pogo stick. This probably shouldn't be left where children can reach it (that's a quip, not a game mechanic).",
                    "aliases": ["HAMMER", "POGOHAMMER", "POGO", "POGO_HAMMER"]
                }
            ]
		},
        {
			"label": "BATHROOM",
			"name":  "your ensuite bathroom",
			"description": "You are in the bathroom attached to your bedroom. There's a toilet, pristine due to your constant efforts to keep it clean, next to a sink and bathtub. You enjoy having your amenities not be a complete mess. The currently closed door to the west leads back to your bedroom.",
			"exits": [
				{
					"destLabel":     "YOUR_ROOM",
					"description":   "the door",
					"aliases":       ["BEDROOM", "ROOM", "DOOR", "WEST"],
					"travelMessage": "You head back into the bedroom."
				}
			]
		},
		{
			"label": "HALLWAY",
			"name":  "the main hallway in your house",
			"description": "This is the main hallway in your house that connects the bedrooms with the living room and kitchen. There's a doorway at the end, but it seems boarded up, and you're pretty sure that's because it represents the limits of the game you're in. I guess you're stuck here. In your home. Housetrapped.\n\nAnyways, there's also your bedroom door at the north end.",
			"exits": [
				{
					"destLabel":     "YOUR_ROOM",
					"description":   "the door to your bedroom",
					"aliases":       ["BEDROOM", "ROOM", "NORTH"],
					"travelMessage": "You step into your bedroom, closing the door behind you for privacy."
				},
				{
					"destLabel": "LIVING_ROOM",
					"description": "The end of the hall, leading to the living room",
					"aliases": ["LIVING_ROOM", "LIVINGROOM", "LIVING ROOM", "DOORWAY", "END"],
					"travelMessage": "Your feelings were wrong, turns out you can pass right through the boards! You go into the living room."
				}
            ]
		},
		{
			"label": "LIVING_ROOM",
			"name": "the communal gathering and hangout room in your house",
			"description": "You are standing in the living room. It is here that you have formed many memories with many people. But... for some reason who those people are eludes you. You seem to remember something about a boy and his father fighting over cake or something like that... or... was it a girl? Perhaps one set to inherit a major baking corporation.\n\nFrom here you can go to the kitchen, through the front door to the yard outside, or back to the hallway towards the bedroom.",
			"exits": [
				{
					"destLabel": "HALLWAY",
					"description": "the hall leading to the bedrooms",
					"aliases": ["HALL", "HALLWAY", "BEDROOMS", "DOORWAY"],
					"travelMessage": "You walk into the hallway towards the bedrooms."
				},
				{
					"destLabel": "KITCHEN",
					"description": "the kitchen of the house",
					"aliases": ["KITCHEN", "MEALBLOCK", "MEAL BLOCK"],
					"travelMessage": "You walk into the kitchen."
				},
				{
					"destLabel": "FRONT_YARD",
					"description": "the front door of the house. There's a neat little window to see people outside, but you don't usually get visitors.",
					"aliases": ["OUTSIDE", "OUT", "YARD", "DOOR", "FRONT DOOR"],
					"travelMessage": "You pull open the front door, letting in a whoosh of wind. It blows your hair into a mess as you step outside, and you brush it out of your eyes."
				}
			]
		},
		{
			"label": "KITCHEN",
			"name": "the kitchen",
			"description": "The place where food is made. It's completely spotless, everything put away nicely and every surface gleaming. The windows let in plenty of light and let you see that there is an exit back to the living room.",
			"exits": [
				{
					"destLabel": "LIVING_ROOM",
					"description": "the entryway back into the living room",
					"aliases": ["LIVINGROOM", "LIVING_ROOM", "LIVING ROOM", "OUT"],
					"travelMessage": "You walk back into the living room."
				}
			]
		},
		{
			"label": "FRONT_YARD",
			"name": "the yard outside your house's front door",
			"description": "You are outside on the lawn of your house. The grass is green and very healthy-looking. From here you can go back into the house, the backyard, and that's pretty much it.",
			"exits": [
				{
					"destLabel": "LIVING_ROOM",
					"description": "the front door of your house, leading directly to the living room",
					"aliases": ["LIVINGROOM", "LIVING_ROOM", "LIVING ROOM", "INSIDE", "HOUSE", "FRONT DOOR", "DOOR"],
					"travelMessage": "You pull open the heavy door and are comforted by the familiar sight of your living room. You step in and shut the door behind you."
				},
				{
					"destLabel": "BACKYARD",
					"description": "the lawn and yard in the back of your house",
					"aliases": ["BACKYARD", "BACK YARD", "BACK", "YARD"],
					"travelMessage": "Grass and twigs crunch under your feet as you walk around to the back yard."
				}
			]
		},
		{
			"label": "BACKYARD",
			"name": "your house's backyard",
			"description": "This is the outside of your house, in the back. There's a nice lawn here, well-kept and manicured, and you see a Pogo ride in a nearby sandbox that seems oddly familiar. There's nowhere to go but back to the front yard, but maybe you should stay for a moment and take a break.",
			"exits": [
				{
					"destLabel": "FRONT_YARD",
					"description": "the yard outside of your house's front door",
					"aliases": ["YARD", "FRONT", "FRONT YARD", "FRONTYARD", "FRONT_YARD", "FRONT LAWN"],
					"travelMessage": "You decide you've had enough of the backyard and decide to go to the front."
				}
			]
		}
    ],
	"pronouns": {
		"joey": {
			"nominative": "JOEY",
			"objective": "JOEY",
			"possesive": "JOEY'S",
			"determiner": "JOEY'S",
			"reflexive": "JOEYSELF"
		}
	},
	"npcs": [
		{
			"label": "IMP",
			"aliases": [
				"IMP",
				"WANDERING IMP",
				"WANDERER"
			],
			"name": "Wanderer, the wandering imp",
			"pronouns": "THEY/THEM",
			"movement": ""
		},
		{
			"label": "JOEYC",
			"aliases": [
				"JOEY",
				"JOEY CLAIRE",
				"GIRL"
			],
			"name": "Joey Claire, gumshoe extraordinaire",
			"pronouns": {
				"nominative": "she",
				"objective": "her",
				"possesive": "hers",
				"COMMENT": "if a key is missing, it will try to be assumed for the common ones (he/her/they and a few spivaks), else it will default to they/them/theirs",
				"COMMENT2": "alternatively, specifying she/her, he/him, they/them, some pre-defined key (or defininig one elsewhere in world file) is allowed instead of inline pronoun setting"
			},
			"movement": null,
			"COMMENT_movement": "(case-insensitive) can be STATIC, empty, null: remain in start, PATROL: follow patrol path [WIP], WANDER: char can wander each turn, includes either 'BLOCK_LIST', or 'ALLOW_LIST' of some kind.",
			"start": "HALLWAY",
			"dialog": [
				{
					"action": "line",
					"COMMENT_type": "can be LINE/empty/null for 'just say content, then go to next in list', or CHOICE for convo tree.",
					"label": "",
					"COMMENT_label": "label is optional but provides a way to refer to a convo for choice.",
					"content": "Hi there, I'm Joey!",
					"response": "Hello, Joey.",
					"COMMENT_response": "not having response is okay but it will default to (cont...)"
				},
				"alternate syntax: \" just having a string implies type=line, content of string, response of null",
				{
					"action": "choice",
					"content": "Who are you?",
					"choices": [
						["Just a wanderer", "IM_WANDERER"],
						["I'm PLAYER!", "IM_PLAYER"]
					]
				},
				{
					"label": "IM_WANDERER",
					"action": "line",
					"content": "Oh, wow! It's nice to meet you, I haven't seen other people here in a long, long time!"
				},
				{
					"action": "end"
				},
				{
					"label": "IM_PLAYER",
					"content": "Your name is PLAYER? That's a weird name!"
				},
				{
					"action": "end"
				}
			],
			"description": "A girl dressed in typical 90's gear, complete with a kaleidoscope of colors. She's carrying around a magnifying glass and looking over the wall, stopping every few moments to examine a spot under her magnifying glass."
		}
	]
}